In [2]:
import pandas as pd
Technologies = {
    'Course':["Python","DBMS","JAVA","DBMS","Spark","Python","Python"],
    'Fee':[20000,25000,26000,22000,24000,30000,35000],
    'Duration':['30days','40days','35days','60days','30days','50days','34days'],
    'Discount':[1000,2300,1200,2500,2000,2100,3000]}
df = pd.DataFrame(Technologies)
print(df)

   Course    Fee Duration  Discount
0  Python  20000   30days      1000
1    DBMS  25000   40days      2300
2    JAVA  26000   35days      1200
3    DBMS  22000   60days      2500
4   Spark  24000   30days      2000
5  Python  30000   50days      2100
6  Python  35000   34days      3000

In [6]:
df.groupby('Course').aggregate({'Duration':'count','Fee':['first','last']})

       Duration    Fee
          count  first   last
Course
DBMS          2  25000  22000
JAVA          1  26000  26000
Python        3  20000  35000
Spark         1  24000  24000

In [8]:
df.groupby('Course').aggregate({'Fee':'count'})

        Fee
Course
DBMS      2
JAVA      1
Python    3
Spark     1